entries/pros-cons/index.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. tech on radar</a></li>
<li><a href="#sec-2">2. haskell</a>
<ul>
<li><a href="#sec-2-1">2.1. pros</a></li>
<li><a href="#sec-2-2">2.2. cons</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Elm</a>
<ul>
<li><a href="#sec-3-1">3.1. pros</a></li>
<li><a href="#sec-3-2">3.2. cons</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Racket</a>
<ul>
<li><a href="#sec-4-1">4.1. pros</a></li>
<li><a href="#sec-4-2">4.2. cons</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Emacs</a>
<ul>
<li><a href="#sec-5-1">5.1. pros</a></li>
<li><a href="#sec-5-2">5.2. cons</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Rust</a>
<ul>
<li><a href="#sec-6-1">6.1. pros</a></li>
<li><a href="#sec-6-2">6.2. cons</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Elixir</a>
<ul>
<li><a href="#sec-7-1">7.1. pros</a></li>
<li><a href="#sec-7-2">7.2. cons</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Clojure</a>
<ul>
<li><a href="#sec-8-1">8.1. pros</a></li>
<li><a href="#sec-8-2">8.2. cons</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> tech on radar</h2>
<div class="outline-text-2" id="text-1">
<p>
haskell
elm
elixir
purescript
racket
emacs
clojure
rust
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> haskell</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> pros</h3>
<div class="outline-text-3" id="text-2-1">
<p>
may have great promise for me as a solo software dev
type theory exposure/familiariy
can be used to write cli apps
pure fp
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> cons</h3>
<div class="outline-text-3" id="text-2-2">
<p>
not many jobs
academic/impractica community
problems iwth tooling
hard. will take a while to become productive
best use cases are server application and scripting lang
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Elm</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> pros</h3>
<div class="outline-text-3" id="text-3-1">
<p>
js lang
</p>
<ul class="org-ul">
<li>games
</li>
<li>apps
</li>
</ul>
<p>
sexy
type theory exposure, intro to haskell
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> cons</h3>
<div class="outline-text-3" id="text-3-2">
<p>
new
unproven
unknown future
no real server side/shell script support yet
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Racket</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> pros</h3>
<div class="outline-text-3" id="text-4-1">
<p>
really interesting
want to explore these ideas in pl design eventually
ignites my passion
academic access
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> cons</h3>
<div class="outline-text-3" id="text-4-2">
<p>
single threaded
small community
no "jobs"
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Emacs</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> pros</h3>
<div class="outline-text-3" id="text-5-1">
<p>
useful; use it all the time
may be great platform for shell scripts
hacker cred
i love it
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> cons</h3>
<div class="outline-text-3" id="text-5-2">
<p>
no good web ui story
no direct value to any companies
other editors may eventually be better
elisp is not as interesting as many other languages
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Rust</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> pros</h3>
<div class="outline-text-3" id="text-6-1">
<p>
systems lang, and i dont know one really
</p>
<ul class="org-ul">
<li>os dev
</li>
<li>vm dev
</li>
<li>3d dev
</li>
</ul>
<p>
interesting types
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> cons</h3>
<div class="outline-text-3" id="text-6-2">
<p>
no gc
weird abstractions
impure fp
not useful in my own career
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Elixir</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> pros</h3>
<div class="outline-text-3" id="text-7-1">
<p>
erlang
macros
great server/webdev career fit
small community
good tools
dialyzer
</p>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> cons</h3>
<div class="outline-text-3" id="text-7-2">
<p>
slow for cpu intensive applications
not incredibly interesting
</p>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Clojure</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> pros</h3>
<div class="outline-text-3" id="text-8-1">
<p>
lisp
close to racket community
reasonable side community
focus on purity
jobs
lots to learn
</p>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> cons</h3>
<div class="outline-text-3" id="text-8-2">
<p>
boring kinda
java slow, slow to start up
relaly only good for server apps
i dont know java
</p>
</div>
</div>
</div>
